Revit 2024 API
Generic.GenericSelfIllumFilterMap Property
 The property labeled "Filter Color" from the "Generic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GenericSelfIllumFilterMap { get; }
Visual Basic
Public Shared ReadOnly Property GenericSelfIllumFilterMap As String
	Get
Visual C++
public:
static property String^ GenericSelfIllumFilterMap {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Generic Class
Autodesk.Revit.DB.Visual Namespace